       IDENTIFICATION DIVISION.                                         
       PROGRAM-ID. PROG1.                                               
       PROCEDURE DIVISION.                                              
      *89112                                                            
           DISPLAY 'WELCOME TO CURSO1'.                                 
           STOP RUN.                                                    